In [1]:
%load_ext sql

/root/anaconda2/lib/python2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/root/anaconda2/lib/python2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

### Next, we'll load an SQLite database stored as a file as follows:

NOTE: We load a file below (here, "sample1.db", which must be in the same directory as the notebook. 
You'll use this file throughout the next few lectures . 
Make sure to download the from the webpage or https://github.com/Kwooley/DBCourse/blob/master/001-SQLite%20SampleDB1

In [2]:
%sql sqlite:///sample1.db

u'Connected: None@sample1.db'

In [4]:
%sql select * from dept;

Done.

[(1, u'\uc601\uc5c5', 8),
 (2, u'\uae30\ud68d', 10),
 (3, u'\uac1c\ubc1c', 9),
 (4, u'\ucd1d\ubd80', 7)]

In [5]:
result = %sql select * from dept;

Done.

In [6]:
print result

+--------+----------+-------+
| deptno | deptname | floor |
+--------+----------+-------+
|   1    |   영업   |   8   |
|   2    |   기획   |   10  |
|   3    |   개발   |   9   |
|   4    |   총부   |   7   |
+--------+----------+-------+

In [7]:
for row in result:
    print row

(1, u'\uc601\uc5c5', 8)
(2, u'\uae30\ud68d', 10)
(3, u'\uac1c\ubc1c', 9)
(4, u'\ucd1d\ubd80', 7)

In [8]:
for row in result:
    print row.deptname

영업
기획
개발
총부

In [9]:
%%sql dname << select deptname 
from dept;

(sqlite3.OperationalError) near "dname": syntax error [SQL: u'dname << select deptname \nfrom dept;']

In [6]:
%sql select * from dept, emp where dept.deptno = emp.dno;

Done.

[(2, u'\uae30\ud68d', 10, 4377, u'\uc774\uc131\ub798', u'\uc0ac\uc7a5', None, 5000000, 2),
 (1, u'\uc601\uc5c5', 8, 3426, u'\ubc15\uc601\uad8c', u'\uacfc\uc7a5', 4377, 3000000, 1),
 (3, u'\uac1c\ubc1c', 9, 3011, u'\uc774\uc218\ubbfc', u'\ubd80\uc7a5', 4377, 4000000, 3),
 (3, u'\uac1c\ubc1c', 9, 3427, u'\ucd5c\uc885\ucca0', u'\uc0ac\uc6d0', 3011, 1500000, 3),
 (2, u'\uae30\ud68d', 10, 1003, u'\uc870\ubbfc\ud76c', u'\uacfc\uc7a5', 4377, 3000000, 2),
 (2, u'\uae30\ud68d', 10, 2106, u'\uae40\ucc3d\uc12d', u'\ub300\ub9ac', 1003, 2500000, 2),
 (1, u'\uc601\uc5c5', 8, 1365, u'\uae40\uc0c1\uc6d0', u'\uc0ac\uc6d0', 3426, 1500000, 1)]

In [9]:
%sql select * from emp;

Done.

[(4377, u'\uc774\uc131\ub798', u'\uc0ac\uc7a5', None, 5000000, 2),
 (3426, u'\ubc15\uc601\uad8c', u'\uacfc\uc7a5', 4377, 3000000, 1),
 (3011, u'\uc774\uc218\ubbfc', u'\ubd80\uc7a5', 4377, 4000000, 3),
 (3427, u'\ucd5c\uc885\ucca0', u'\uc0ac\uc6d0', 3011, 1500000, 3),
 (1003, u'\uc870\ubbfc\ud76c', u'\uacfc\uc7a5', 4377, 3000000, 2),
 (2106, u'\uae40\ucc3d\uc12d', u'\ub300\ub9ac', 1003, 2500000, 2),
 (1365, u'\uae40\uc0c1\uc6d0', u'\uc0ac\uc6d0', 3426, 1500000, 1)]

In [7]:
%%sql
select * from dept, emp
where dept.deptno = emp.dno;

Done.

[(2, u'\uae30\ud68d', 10, 4377, u'\uc774\uc131\ub798', u'\uc0ac\uc7a5', None, 5000000, 2),
 (1, u'\uc601\uc5c5', 8, 3426, u'\ubc15\uc601\uad8c', u'\uacfc\uc7a5', 4377, 3000000, 1),
 (3, u'\uac1c\ubc1c', 9, 3011, u'\uc774\uc218\ubbfc', u'\ubd80\uc7a5', 4377, 4000000, 3),
 (3, u'\uac1c\ubc1c', 9, 3427, u'\ucd5c\uc885\ucca0', u'\uc0ac\uc6d0', 3011, 1500000, 3),
 (2, u'\uae30\ud68d', 10, 1003, u'\uc870\ubbfc\ud76c', u'\uacfc\uc7a5', 4377, 3000000, 2),
 (2, u'\uae30\ud68d', 10, 2106, u'\uae40\ucc3d\uc12d', u'\ub300\ub9ac', 1003, 2500000, 2),
 (1, u'\uc601\uc5c5', 8, 1365, u'\uae40\uc0c1\uc6d0', u'\uc0ac\uc6d0', 3426, 1500000, 1)]